-- ----------------------------
-- Add sys_info
-- ----------------------------
CREATE TABLE IF NOT EXISTS `sys_info` (
    `id` VARCHAR(40) NOT NULL PRIMARY KEY COMMENT '主键ID',
    `name` VARCHAR(255) DEFAULT NULL COMMENT '系统名称',
    `description` text DEFAULT NULL COMMENT '系统简介'
    ) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE utf8_general_ci COMMENT='系统信息表';

INSERT INTO `sys_info`(`id`, `name`, `description`) VALUES ('1', 'system', '本系统为采用大数据流水线技术开发的生态站生态系统长期监测数据产品生产系统（V1.0版本）。系统面向生态系统重要服务功能和质量评估，根据《生态系统监测数据产品分类分级规范》和《生态系统关键指标数据产品生产技术规范》的要求，主要实现生态系统重要服务功能（包括生产力和固碳、生物多样性、水源涵养、土壤保持、防风固沙）评估相关的生态系统要素观测数据的质量控制和以及生态系统要素、功能和质量数据产品的加工生产。\n系统目前支持2个大类、9个中类、12个小类、共计30个指标的数据质量控制和数据产品生产，用于构建生态站从生态系统要素、过程、功能到质量的标准化数据产品体系。这些数据产品可以支撑典型生态系统结构、过程和功能的长期动态变化研究以及跨站点联网研究，并可作为生态系统评估的参照基准，服务于国家和典型区域生态系统状况评估。\n系统由国家重点研发计划项目“生态系统大数据智能管理与挖掘关键技术及应用” 资助开发。国家生态科学数据中心后续将逐步开展其他生态系统要素观测指标的数据质量控制和数据产品加工流水线开发，支撑野外台站生态系统联网观测数据的高质量数据供给。\n具体使用方法详见《系统使用说明文档》。');